run/tutorials/flowTests/staticCylinderSheddingTest/bodyFittedCylinder/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


convertToMeters 1.0e-02;

vertices
(
    (-4 -4 -0.1)
    (-1.4142 -4 -0.1)
    (1.4142 -4 -0.1)
    (8 -4 -0.1)
    (16 -4 -0.1)
    (-4 -1.4142 -0.1)
    (-1.4142 -1.4142 -0.1)
    (1.4142 -1.4142 -0.1)
    (8 -1.4142 -0.1)
    (16 -1.4142 -0.1)
    (-4 1.4142 -0.1)
    (-1.4142 1.4142 -0.1)
    (1.4142 1.4142 -0.1)
    (8 1.4142 -0.1)
    (16 1.4142 -0.1)
    (-4 4 -0.1)
    (-1.4142 4 -0.1)
    (1.4142 4 -0.1)
    (8 4 -0.1)
    (16 4 -0.1)
    (-0.707 -0.707 -0.1)
    (0.707 -0.707 -0.1)
    (-0.707 0.707 -0.1)
    (0.707 0.707 -0.1)
    (-4 -4 0.1)
    (-1.4142 -4 0.1)
    (1.4142 -4 0.1)
    (8 -4 0.1)
    (16 -4 0.1)
    (-4 -1.4142 0.1)
    (-1.4142 -1.4142 0.1)
    (1.4142 -1.4142 0.1)
    (8 -1.4142 0.1)
    (16 -1.4142 0.1)
    (-4 1.4142 0.1)
    (-1.4142 1.4142 0.1)
    (1.4142 1.4142 0.1)
    (8 1.4142 0.1)
    (16 1.4142 0.1)
    (-4 4 0.1)
    (-1.4142 4 0.1)
    (1.4142 4 0.1)
    (8 4 0.1)
    (16 4 0.1)
    (-0.707 -0.707 0.1)
    (0.707 -0.707 0.1)
    (-0.707 0.707 0.1)
    (0.707 0.707 0.1)
);


edges
(
// inside edges
    arc 20 21 (0 -1 -0.1)
    arc 21 23 (1 0 -0.1)
    arc 23 22 (0 1 -0.1)
    arc 22 20 (-1 0 -0.1)
    arc 44 45 (0 -1 0.1)
    arc 45 47 (1 0 0.1)
    arc 47 46 (0 1 0.1)
    arc 46 44 (-1 0 0.1)

// outside edges
    arc 6 7 (0 -2 -0.1)
    arc 7 12 (2 0 -0.1)
    arc 12 11 (0 2 -0.1)
    arc 11 6 (-2 0 -0.1)
    arc 30 31 (0 -2 0.1)
    arc 31 36 (2 0 0.1)
    arc 36 35 (0 2 0.1)
    arc 35 30 (-2 0 0.1)
);


blocks
(
    hex (0 1 6 5 24 25 30 29) (20 20 1) simpleGrading (1.0 1.0 1.0)
    hex (1 2 7 6 25 26 31 30) (20 20 1) simpleGrading (1.0 1.0 1.0)
    hex (2 3 8 7 26 27 32 31) (40 20 1) simpleGrading (1.0 1.0 1.0)
    hex (3 4 9 8 27 28 33 32) (60 20 1) simpleGrading (1.0 1.0 1.0)
    hex (5 6 11 10 29 30 35 34) (20 20 1) simpleGrading (1.0 1.0 1.0)
    hex (7 8 13 12 31 32 37 36) (40 20 1) simpleGrading (1.0 1.0 1.0)
    hex (8 9 14 13 32 33 38 37) (60 20 1) simpleGrading (1.0 1.0 1.0)
    hex (10 11 16 15 34 35 40 39) (20 20 1) simpleGrading (1.0 1.0 1.0)
    hex (11 12 17 16 35 36 41 40) (20 20 1) simpleGrading (1.0 1.0 1.0)
    hex (12 13 18 17 36 37 42 41) (40 20 1) simpleGrading (1.0 1.0 1.0)
    hex (13 14 19 18 37 38 43 42) (60 20 1) simpleGrading (1.0 1.0 1.0)
    hex (6 7 21 20 30 31 45 44) (20 15 1) simpleGrading (1.0 1.0 1.0)
    hex (7 12 23 21 31 36 47 45) (20 15 1) simpleGrading (1.0 1.0 1.0)
    hex (12 11 22 23 36 35 46 47) (20 15 1) simpleGrading (1.0 1.0 1.0)
    hex (11 6 20 22 35 30 44 46) (20 15 1) simpleGrading (1.0 1.0 1.0)
);

patches
(
    patch
    inlet
    (
        4(0 24 29 5)
        4(5 29 34 10)
        4(10 34 39 15)
    )

    patch
    outlet
    (
        4(4 9 33 28)
        4(9 14 38 33)
        4(14 19 43 38)
    )

    patch
    bottom
    (
        4(0 1 25 24)
        4(1 2 26 25)
        4(2 3 27 26)
        4(3 4 28 27)
    )

    patch
    top
    (
        4(15 39 40 16)
        4(16 40 41 17)
        4(17 41 42 18)
        4(18 42 43 19)
    )

    wall
    cylinder
    (
        4(20 44 45 21)
        4(21 45 47 23)
        4(23 47 46 22)
        4(22 46 44 20)
    )
);

mergePatchPairs 
(
);


// ************************************************************************* //
